# IS362 - Project 3

In [1]:
# import libraries
import sqlalchemy as sqla
import pandas as pd

In [2]:
# import and connect to sqlite db
db = sqla.create_engine('sqlite:///Chinook_Sqlite.sqlite')

Create a pandas DataFrame that displays Customers’ Last Name and First Name, and each customer’s purchased Track names and
Album Titles. 

The information will be sorted by Customer LastName then Customer FirstName.

In [3]:
# query

sql = ''' SELECT Customer.LastName, Customer.FirstName, Track.Name, Album.Title
          FROM Invoiceline
          JOIN Invoice ON InvoiceLine.InvoiceId = Invoice.InvoiceId
          JOIN Customer ON Invoice.CustomerId = Customer.CustomerId
          JOIN Track ON InvoiceLine.TrackId = Track.TrackId
          JOIN Album ON Track.AlbumId = Album.AlbumId
          ORDER BY LastName, FirstName'''

# display the first 5 rows of the dataframe
pd.read_sql(sql, db).head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas